[
    {
        "id": 1,
        "name": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://lifewithtwotees.com/wp-content/uploads/2020/01/ar-190329317.jpg",
        "review": "A gripping psychological thriller that keeps you guessing until the very end. Michaelides masterfully weaves a tale of suspense and intrigue, leaving readers on the edge of their seats. The narrative unfolds with clever twists and turns, drawing you deeper into the enigmatic world of the silent patient. With its well-developed characters and a plot that keeps you guessing, this novel is a must-read for anyone craving a captivating and thought-provoking mystery.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Mystery",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "id": 2,
        "name": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "https://target.scene7.com/is/image/Target/GUEST_bbf074b5-94fb-4905-937a-b249520599d0?wid=600&hei=600&qlt=80&fmt=webp",
        "review": "A beautifully written novel that immerses you in the marshlands of North Carolina. Owens' lyrical prose and vivid imagery make this a must-read. The story unfolds with a perfect blend of mystery, romance, and coming-of-age themes. As Kya navigates the complexities of love and survival, readers are drawn into her world, feeling every triumph and heartbreak. Where the Crawdads Sing is a poignant tale of resilience, love, and the beauty of nature that will stay with you long after you turn the last page.",
        "totalPages": 384,
        "rating": 4.7,
        "category": "Fiction",
        "tags": [
            "Nature",
            "Coming-of-age"
        ],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "id": 3,
        "name": "Educated: A Memoir",
        "author": "Tara Westover",
        "image": "https://www.gertrudeandalice.com.au/wp-content/uploads/2021/08/Screen-Shot-2021-08-28-at-6.29.48-pm-600x601.png",
        "review": "Tara Westover's 'Educated: A Memoir' is a compelling narrative of self-discovery and resilience. From her upbringing in a strict and isolated household to her journey towards education and empowerment, Westover’s memoir is both heartbreaking and inspiring. Her vivid storytelling captures the challenges she faced and the triumphs she achieved, leaving readers profoundly moved. 'Educated' is not just a story of academic success; it’s a testament to the power of perseverance, courage, and the pursuit of knowledge against all odds.",
        "totalPages": 352,
        "rating": 4.6,
        "category": "Memoir",
        "tags": [
            "Education",
            "Family"
        ],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "id": 4,
        "name": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://www.bigw.com.au/medias/sys_master/images/images/h5f/hf9/34526163763230.jpg",
        "review": "Step into the mesmerizing world of 'The Night Circus,' where magic and mystery entwine in a spellbinding tale. Morgenstern's lush prose and imaginative storytelling create an enchanting atmosphere that captivates from the first page to the last. The competition between two young illusionists becomes a backdrop for a love story as captivating as it is forbidden. With its vivid descriptions and intricate plot, 'The Night Circus' is a feast for the senses, transporting readers to a realm where dreams and reality collide in the most wondrous ways.",
        "totalPages": 400,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Romance"
        ],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "id": 5,
        "name": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://www.liveauctioneers.com/news/wp-content/uploads/2018/03/lf-1.jpg",
        "review": "F. Scott Fitzgerald's 'The Great Gatsby' is a timeless masterpiece that delves into the complexities of the American Dream. Set against the backdrop of the roaring twenties, the novel paints a vivid picture of the Jazz Age's opulence and decadence. Through the enigmatic Jay Gatsby and the narrator, Nick Carraway, Fitzgerald explores themes of love, ambition, and the pursuit of happiness. With its lyrical prose and unforgettable characters, 'The Great Gatsby' remains a poignant commentary on the elusive nature of the American Dream and the human condition.",
        "totalPages": 180,
        "rating": 4.3,
        "category": "Classic",
        "tags": [
            "Roaring Twenties",
            "Love"
        ],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "id": 6,
        "name": "Becoming",
        "author": "Michelle Obama",
        "image": "https://res.cloudinary.com/itimages/image/upload/f_auto,q_auto,w_800,c_limit/prd/splash_cover_art/lbiqie0lj3tffo5azykf",
        "review": "In 'Becoming,' Michelle Obama invites readers into her world with warmth, candor, and grace. From her humble beginnings on the South Side of Chicago to her journey as First Lady of the United States, Obama's memoir is a testament to resilience, hope, and the power of authenticity. Her story inspires and empowers, offering insights into the challenges and triumphs that shaped her life. Through her honest reflections and heartfelt anecdotes, Obama reminds us of the importance of staying true to ourselves and embracing the journey of becoming who we are meant to be.",
        "totalPages": 448,
        "rating": 4.8,
        "category": "Biography",
        "tags": [
            "Inspiration",
            "Leadership"
        ],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2018
    }
]